blog/36.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 4.2.1 and 4.2.2
#+subtitle: <2024-09-18 Wed>
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.60 (<a href="https://orgmode.org">Org</a> mode 9.7.5)

* 4.2.1 Normal Order and Applicative Order

/Lazy evaluation/ is the technique of delaying the evaluation of
procedure arguments until their values are needed.  Roughly, languages
that evaluate lazily are called ``normal-order'' languages and those
that do not are called ``applicative-order'' languages.

Since Scheme is an applicative-order language, the following will give
an error:
#+begin_src scheme
  (define (try a b)
    (if (= a 0) 1 b))

  (try 0 (/ 1 0)) ;; => error, division by 0
#+end_src

A procedure is said to "strict" in those arguments which are evaluated
before the body of the procedure is entered, and it is said to be
"non-strict" in those arguments which are not evaluated before the
body of the procedure is entered.

** Exercise 4.25
*Exercise*:

#+begin_quote
Suppose that (in ordinary applicative-order Scheme) we define ~unless~
as shown above and then define ~factorial~ in terms of ~unless~ as

#+begin_src scheme
  (define (factorial n)
    (unless (= n 1)
      (* n (factorial (- n 1)))
      1))
#+end_src

What happens if we attempt to evaluate ~(factorial 5)~? Will our
definitions work in a normal-order language?
#+end_quote

*Answer*:

At some point, the chain of recursive calls ends up calling ~unless~
where ~n~ is bound to 1.

This means that the second argument passed to ~unless~, if evaluated,
would entail the application of ~factorial~ to ~0~.

An applicative order evaluation language would evaluate it; so it
would initiate an infinite chain of applications (because the
terminating condition will never be satisfied).

But there should be no problem in a normal-order language.

** Exercise 4.26
*Exercise*:

#+begin_quote
Ben Bitdiddle and Alyssa P. Hacker disagree over the importance of
lazy evaluation for implementing things such as ~unless~.  Ben points
out that it's possible to implement ~unless~ in applicative order as a
special form.  Alyssa counters that, if one did that, ~unless~ would
be merely syntax, not a procedure that could be used in conjunction
with higher-order procedures.  Fill in the details on both sides of
the argument.  Show how to implement ~unless~ as a derived expression
(like ~cond~ or ~let~), and give an example of a situation where it
might be useful to have ~unless~ available as a procedure, rather than
as a special form.
#+end_quote

*Answer*:

Remember that Authors stated:
#+begin_quote
Some special forms in our language can be defined in terms of
expressions involving other special forms, rather than being
implemented directly (p. ?) [...] Expressions (such as cond) that we
choose to implement as syntactic transformations are called /derived
expressions/.
#+end_quote
That is the way Authors understand ~unless~ to be a special form
(i.e., defined in terms of ~if~).

We can transform an ~unless~ expression into an ~if~ expression in the
following way:

#+begin_src scheme
  (define (tagged-list? exp tag)
    (if (pair? exp)
        (eq? (car exp) tag)
        false))

  (define (unless? exp)
    (tagged-list? exp 'unless))

  (define (unless-condition exp)
    (cadr exp))

  (define (unless-usual-value exp)
    (caddr exp))

  (define (unless-exceptional-value exp)
    (cadddr exp))

  (define (unless->if exp)
    (list 'if
          (unless-condition exp)
          (unless-exceptional-value exp)
          (unless-usual-value exp)))
#+end_src

Ben is right that we can implement ~unless~ as a special form. Alyssa
is right in maintaining that, if implemented that way, it could not be
passed to higher-order procedures. The reason is that the arguments of
a procedures are evaluated; the evaluation of a symbol which is bound
to procedure will return a procedure object, but if we evaluate the
``name'' of special form, then we try to look it up as if it was a
variable name; but there is not such a binding in the environment.

It's kind of hard to think of a case where it would be useful to have
~unless~ as a procedure. The only thing I can think of is something
like ~BOH~, that is, a procedure that gives the user the choice of how
to deal with a certain condition.

#+begin_src scheme
  (define BOH
    (lambda (cond-eval-strategy cond alt1 alt2)
      (cond-eval-strategy cond alt1 alt2)))
#+end_src

