blog/36.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-18 Wed 20:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 4.2.1 and 4.2.2</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 4.2.1 and 4.2.2</h1>
<div id="outline-container-orgadd3c82" class="outline-2">
<h2 id="orgadd3c82">4.2.1 Normal Order and Applicative Order</h2>
<div class="outline-text-2" id="text-orgadd3c82">
<p>
<i>Lazy evaluation</i> is the technique of delaying the evaluation of
procedure arguments until their values are needed.  Roughly, languages
that evaluate lazily are called ``normal-order'' languages and those
that do not are called ``applicative-order'' languages.
</p>

<p>
Since Scheme is an applicative-order language, the following will give
an error:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">try</span> a b)
  (<span style="color: #531ab6;">if</span> (= a 0) 1 b))

(try 0 (/ 1 0)) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; error, division by 0</span>
</pre>
</div>

<p>
A procedure is said to "strict" in those arguments which are evaluated
before the body of the procedure is entered, and it is said to be
"non-strict" in those arguments which are not evaluated before the
body of the procedure is entered.
</p>
</div>
<div id="outline-container-orged4afdd" class="outline-3">
<h3 id="orged4afdd">Exercise 4.25</h3>
<div class="outline-text-3" id="text-orged4afdd">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Suppose that (in ordinary applicative-order Scheme) we define <code>unless</code>
as shown above and then define <code>factorial</code> in terms of <code>unless</code> as
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">factorial</span> n)
  (<span style="color: #531ab6;">unless</span> (= n 1)
    (* n (factorial (- n 1)))
    1))
</pre>
</div>

<p>
What happens if we attempt to evaluate <code>(factorial 5)</code>? Will our
definitions work in a normal-order language?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
At some point, the chain of recursive calls ends up calling <code>unless</code>
where <code>n</code> is bound to 1.
</p>

<p>
This means that the second argument passed to <code>unless</code>, if evaluated,
would entail the application of <code>factorial</code> to <code>0</code>.
</p>

<p>
An applicative order evaluation language would evaluate it; so it
would initiate an infinite chain of applications (because the
terminating condition will never be satisfied).
</p>

<p>
But there should be no problem in a normal-order language.
</p>
</div>
</div>
<div id="outline-container-orgbbc84bc" class="outline-3">
<h3 id="orgbbc84bc">Exercise 4.26</h3>
<div class="outline-text-3" id="text-orgbbc84bc">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Ben Bitdiddle and Alyssa P. Hacker disagree over the importance of
lazy evaluation for implementing things such as <code>unless</code>.  Ben points
out that it's possible to implement <code>unless</code> in applicative order as a
special form.  Alyssa counters that, if one did that, <code>unless</code> would
be merely syntax, not a procedure that could be used in conjunction
with higher-order procedures.  Fill in the details on both sides of
the argument.  Show how to implement <code>unless</code> as a derived expression
(like <code>cond</code> or <code>let</code>), and give an example of a situation where it
might be useful to have <code>unless</code> available as a procedure, rather than
as a special form.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Remember that Authors stated:
</p>
<blockquote>
<p>
Some special forms in our language can be defined in terms of
expressions involving other special forms, rather than being
implemented directly (p. ?) [&#x2026;] Expressions (such as cond) that we
choose to implement as syntactic transformations are called <i>derived
expressions</i>.
</p>
</blockquote>
<p>
That is the way Authors understand <code>unless</code> to be a special form
(i.e., defined in terms of <code>if</code>).
</p>

<p>
We can transform an <code>unless</code> expression into an <code>if</code> expression in the
following way:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tagged-list?</span> exp tag)
  (<span style="color: #531ab6;">if</span> (pair? exp)
      (eq? (car exp) tag)
      false))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">unless?</span> exp)
  (tagged-list? exp 'unless))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">unless-condition</span> exp)
  (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">unless-usual-value</span> exp)
  (caddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">unless-exceptional-value</span> exp)
  (cadddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">unless-&gt;if</span> exp)
  (list 'if
        (unless-condition exp)
        (unless-exceptional-value exp)
        (unless-usual-value exp)))
</pre>
</div>

<p>
Ben is right that we can implement <code>unless</code> as a special form. Alyssa
is right in maintaining that, if implemented that way, it could not be
passed to higher-order procedures. The reason is that the arguments of
a procedures are evaluated; the evaluation of a symbol which is bound
to procedure will return a procedure object, but if we evaluate the
``name'' of special form, then we try to look it up as if it was a
variable name; but there is not such a binding in the environment.
</p>

<p>
It's kind of hard to think of a case where it would be useful to have
<code>unless</code> as a procedure. The only thing I can think of is something
like <code>BOH</code>, that is, a procedure that gives the user the choice of how
to deal with a certain condition.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">BOH</span>
  (<span style="color: #531ab6;">lambda</span> (cond-eval-strategy cond alt1 alt2)
    (cond-eval-strategy cond alt1 alt2)))
</pre>
</div>
</div>
</div>
</div>
