blog/36.org
* 4.2.2 An Interpreter with Lazy Evaluation
Authors show the implementation of a (normal-order) Scheme in which
compounde procedures are non-strict (in each argument) --- but
primitive procedures keep being strict.

When the evaluator applies a compound procedures, instead of
evaluating the arguments, it turns them into object called
``thunks''. Thunks contain all the information that is need to
evaluate the arguments as if it was evaluated at application time. The
evalution of a thunk is called ``forcing''.

Thunks are to be forced when:
- they are passed to a primitive procedure;
- when they are the predicate of a conditional;
- when they are the operator of an application.

The evaluator memoizes the thunk. That is, if a thunk is forced,
future forcirg can just retrieve their already-computed value.

Here is the new code:

#+begin_src scheme
  (define (eval exp env)
    ...
    ((application? exp)
     (apply (actual-value (operator exp) env)
            (operands exp)
            env))
    ...)

  (define (actual-value exp env)
    (force-it (eval exp env)))

  (define (apply procedure arguments env)
    (cond ((primitive-procedure? procedure)
           (apply-primitive-procedure
            procedure
            (list-of-arg-values arguments env)))  ; changed
          ((compound-procedure? procedure)
           (eval-sequence
            (procedure-body procedure)
            (extend-environment
             (procedure-parameters procedure)
             (list-of-delayed-args arguments env) ; changed
             (procedure-environment procedure))))
          (else
           (error
            "Unknown procedure type -- APPLY" procedure))))

  (define (list-of-arg-values exps env)
    (if (no-operands? exps)
        '()
        (cons (actual-value (first-operand exps) env)
              (list-of-arg-values (rest-operands exps)
                                  env))))

  (define (list-of-delayed-args exps env)
    (if (no-operands? exps)
        '()
        (cons (delay-it (first-operand exps) env)
              (list-of-delayed-args (rest-operands exps)
                                    env))))
  (define (eval-if exp env)
    (if (true? (actual-value (if-predicate exp) env))
        (eval (if-consequent exp) env)
        (eval (if-alternative exp) env)))

  (define input-prompt ";;; L-Eval input:")
  (define output-prompt ";;; L-Eval value:")

  (define (driver-loop)
    (prompt-for-input input-prompt)
    (let ((input (read)))
      (let ((output
             (actual-value input the-global-environment)))
        (announce-output output-prompt)
        (user-print output)))
    (driver-loop))

  (define (delay-it exp env)
    (list 'thunk exp env))

  (define (thunk? obj)
    (tagged-list? obj 'thunk))

  (define (thunk-exp thunk) (cadr thunk))

  (define (thunk-env thunk) (caddr thunk))

  (define (evaluated-thunk? obj)
    (tagged-list? obj 'evaluated-thunk))

  (define (thunk-value evaluated-thunk) (cadr evaluated-thunk))

  (define (force-it obj)
    (cond ((thunk? obj)
           (let ((result (actual-value
                          (thunk-exp obj)
                          (thunk-env obj))))
             (set-car! obj 'evaluated-thunk)
             (set-car! (cdr obj) result)  ; replace `exp' with its value
             (set-cdr! (cdr obj) '())     ; forget unneeded `env'
             result))
          ((evaluated-thunk? obj)
           (thunk-value obj))
          (else obj)))
#+end_src

** Exercise 4.27
*Exercise*:

#+begin_quote
Suppose we type in the following definitions to the lazy evaluator:

#+begin_src scheme
  (define count 0)

  (define (id x)
    (set! count (+ count 1))
    x)
#+end_src

Give the missing values in the following sequence of interactions, and
explain your answers.(5)

#+begin_src scheme
  (define w (id (id 10)))

  ;;; L-Eval input:
  count
  ;;; L-Eval value:
  <RESPONSE>

  ;;; L-Eval input:
  w
  ;;; L-Eval value:
  <RESPONSE>

  ;;; L-Eval input:
  count
  ;;; L-Eval value:
  <RESPONSE>
#+end_src
#+end_quote

*Answer*:

The first <RESPONSE> is 1 (I thought it was 0...). When we evaluate
~(define w (id (id 10)))~, among other things, we apply ~eval~ to the
``definition-value'', that is, to ~(id (id 10))~.

That's the application of a compound procedure (of the outer
~id~). Regardless of lazy evaluation, that means we are going to
evaluate the expressions of the body of ~id~ (in an environment in
which the parameters are set to delayed values).

This means, first, that the ~set!~ in the body is evaluated, so
~count~ won't be 1 anymore. And, second, that the value of the final
expression --- that value ~w~ is set to --- will be a thunk.

The second <RESPONSE> is 10: we are trying to print a thunk, so the
thunk is forced (remember the modification we made to the driver
loop).

The third <RESPONSE> is 2. To print the value of ~w~ we nee to perform
the application of the inner ~id~ (which entails increasing ~count~
for the second time).
