blog/36.html
<div id="outline-container-org6d93ecc" class="outline-2">
<h2 id="org6d93ecc">4.2.2 An Interpreter with Lazy Evaluation</h2>
<div class="outline-text-2" id="text-org6d93ecc">
<p>
Authors show the implementation of a (normal-order) Scheme in which
compounde procedures are non-strict (in each argument) &#x2014; but
primitive procedures keep being strict.
</p>

<p>
When the evaluator applies a compound procedures, instead of
evaluating the arguments, it turns them into object called
``thunks''. Thunks contain all the information that is need to
evaluate the arguments as if it was evaluated at application time. The
evalution of a thunk is called ``forcing''.
</p>

<p>
Thunks are to be forced when:
</p>
<ul class="org-ul">
<li>they are passed to a primitive procedure;</li>
<li>when they are the predicate of a conditional;</li>
<li>when they are the operator of an application.</li>
</ul>

<p>
The evaluator memoizes the thunk. That is, if a thunk is forced,
future forcirg can just retrieve their already-computed value.
</p>

<p>
Here is the new code:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval</span> exp env)
  ...
  ((application? exp)
   (apply (actual-value (operator exp) env)
          (operands exp)
          env))
  ...)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">actual-value</span> exp env)
  (force-it (eval exp env)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply</span> procedure arguments env)
  (<span style="color: #531ab6;">cond</span> ((primitive-procedure? procedure)
         (apply-primitive-procedure
          procedure
          (list-of-arg-values arguments env)))  <span style="color: #595959;">; </span><span style="color: #595959;">changed</span>
        ((compound-procedure? procedure)
         (eval-sequence
          (procedure-body procedure)
          (extend-environment
           (procedure-parameters procedure)
           (list-of-delayed-args arguments env) <span style="color: #595959;">; </span><span style="color: #595959;">changed</span>
           (procedure-environment procedure))))
        (<span style="color: #531ab6;">else</span>
         (error
          <span style="color: #3548cf;">"Unknown procedure type -- APPLY"</span> procedure))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">list-of-arg-values</span> exps env)
  (<span style="color: #531ab6;">if</span> (no-operands? exps)
      '()
      (cons (actual-value (first-operand exps) env)
            (list-of-arg-values (rest-operands exps)
                                env))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">list-of-delayed-args</span> exps env)
  (<span style="color: #531ab6;">if</span> (no-operands? exps)
      '()
      (cons (delay-it (first-operand exps) env)
            (list-of-delayed-args (rest-operands exps)
                                  env))))
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-if</span> exp env)
  (<span style="color: #531ab6;">if</span> (true? (actual-value (if-predicate exp) env))
      (eval (if-consequent exp) env)
      (eval (if-alternative exp) env)))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">input-prompt</span> <span style="color: #3548cf;">";;; L-Eval input:"</span>)
(<span style="color: #531ab6;">define</span> <span style="color: #721045;">output-prompt</span> <span style="color: #3548cf;">";;; L-Eval value:"</span>)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">driver-loop</span>)
  (prompt-for-input input-prompt)
  (<span style="color: #531ab6;">let</span> ((input (read)))
    (<span style="color: #531ab6;">let</span> ((output
           (actual-value input the-global-environment)))
      (announce-output output-prompt)
      (user-print output)))
  (driver-loop))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">delay-it</span> exp env)
  (list 'thunk exp env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">thunk?</span> obj)
  (tagged-list? obj 'thunk))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">thunk-exp</span> thunk) (cadr thunk))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">thunk-env</span> thunk) (caddr thunk))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">evaluated-thunk?</span> obj)
  (tagged-list? obj 'evaluated-thunk))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">thunk-value</span> evaluated-thunk) (cadr evaluated-thunk))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">force-it</span> obj)
  (<span style="color: #531ab6;">cond</span> ((thunk? obj)
         (<span style="color: #531ab6;">let</span> ((result (actual-value
                        (thunk-exp obj)
                        (thunk-env obj))))
           (set-car! obj 'evaluated-thunk)
           (set-car! (cdr obj) result)  <span style="color: #595959;">; </span><span style="color: #595959;">replace `exp' with its value</span>
           (set-cdr! (cdr obj) '())     <span style="color: #595959;">; </span><span style="color: #595959;">forget unneeded `env'</span>
           result))
        ((evaluated-thunk? obj)
         (thunk-value obj))
        (<span style="color: #531ab6;">else</span> obj)))
</pre>
</div>
</div>
<div id="outline-container-org55ac327" class="outline-3">
<h3 id="org55ac327">Exercise 4.27</h3>
<div class="outline-text-3" id="text-org55ac327">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Suppose we type in the following definitions to the lazy evaluator:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">count</span> 0)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">id</span> x)
  (set! count (+ count 1))
  x)
</pre>
</div>

<p>
Give the missing values in the following sequence of interactions, and
explain your answers.(5)
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">w</span> (id (id 10)))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
count
<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
<span style="color: #005f5f;">&lt;RESPONSE&gt;</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
w
<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
<span style="color: #005f5f;">&lt;RESPONSE&gt;</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
count
<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
<span style="color: #005f5f;">&lt;RESPONSE&gt;</span>
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
The first &lt;RESPONSE&gt; is 1 (I thought it was 0&#x2026;). When we evaluate
<code>(define w (id (id 10)))</code>, among other things, we apply <code>eval</code> to the
``definition-value'', that is, to <code>(id (id 10))</code>.
</p>

<p>
That's the application of a compound procedure (of the outer
<code>id</code>). Regardless of lazy evaluation, that means we are going to
evaluate the expressions of the body of <code>id</code> (in an environment in
which the parameters are set to delayed values).
</p>

<p>
This means, first, that the <code>set!</code> in the body is evaluated, so
<code>count</code> won't be 1 anymore. And, second, that the value of the final
expression &#x2014; that value <code>w</code> is set to &#x2014; will be a thunk.
</p>

<p>
The second &lt;RESPONSE&gt; is 10: we are trying to print a thunk, so the
thunk is forced (remember the modification we made to the driver
loop).
</p>

<p>
The third &lt;RESPONSE&gt; is 2. To print the value of <code>w</code> we nee to perform
the application of the inner <code>id</code> (which entails increasing <code>count</code>
for the second time).
</p>
</div>
</div>
