blog/36.org
** Exercise 4.28
*Exercise*:

#+begin_quote
~Eval~ uses ~actual-value~ rather than ~eval~ to evaluate the operator
before passing it to ~apply~, in order to force the value of the
operator. Give an example that demonstrates the need for this forcing.
#+end_quote

*Answer*:

Example: higher order functions. E.g., ~map~.

#+begin_src scheme
  ;; Unmodified evaluator (using `actual-value'):

  ;;; L-Eval input:
  (define (add1 x)
    (+ x 1))

  ;;; L-Eval value:
  ok

  ;;; L-Eval input:
  (define (map proc items)
    (if (null? items)
        '()
        (cons (proc (car items))
              (map proc (cdr items)))))

  ;;; L-Eval value:
  ok

  ;;; L-Eval input:
  (map add1 '(1 2 3))

  ;;; L-Eval value:
  (2 3 4)
#+end_src

#+begin_src scheme
  ;; Using `eval' instead of `actual-value':

  ;;; L-Eval input:
  (define (add1 x)
    (+ x 1))

  ;;; L-Eval value:
  ok

  ;;; L-Eval input:
  (add1 5)

  ;;; L-Eval value:
  6

  ;;; L-Eval input:
  (define (map proc items)
    (if (null? items)
        '()
        (cons (proc (car items))
              (map proc (cdr items)))))

  ;;; L-Eval value:
  ok

  ;;; L-Eval input:
  (map add1 '(1 2 3))
  . . Unknown procedure type -- APPLY (thunk add1 #0=(((map add1 try false true car cdr cons null? = + - * /) (procedure (proc items) ((if (null? items) '() (cons (proc (car items)) (map proc (cdr items))))) #0#) (procedure (x) ((+ x 1)) #0#) (procedure (a b) ((if (= a 0) 1 b)) #0#) #...
#+end_src
** Exercise 4.29
*Exercise*:

#+begin_quote
Exhibit a program that you would expect to run much more slowly
without memoization than with memoization.  Also, consider the
following interaction, where the ~id~ procedure is defined as in *Note 4.27
and ~count~ starts at 0:

#+begin_src scheme
  (define (square x)
    (* x x))

  ;;; L-Eval input:
  (square (id 10))
  ;;; L-Eval value:
  <RESPONSE>

  ;;; L-Eval input:
  count
  ;;; L-Eval value:
  <RESPONSE>
#+end_src

Give the responses both when the evaluator memoizes and when it
does not.
#+end_quote

*Answer*:

The argument of ~(square (id 10))~ is delayed (turned into a thunk),
In the body of ~square~, though, we have the application of a
primitive procedure (~(* thunk thunk)~) so the thunks must be
forced. Given that the two thunks are the same thunk, if we memoize,
then the final <RESPONSE> is 1, otherwise is 2. The first <RESPONSE>
is 100, regardless of whether we memoize or not.

Clearly memoization will entail an improvement in performance in those
cases in which we need the value for the same thunk many times and
where forcing the thunk requires non-trivial computation.

The procedures ~fact~ and ~fib~ are two example where a difference can
be seen.

#+begin_src scheme
  (eval '(define (fact n)
           (if (= n 1)
               1
               (* n (fact (- n 1)))))
        the-global-environment)

  (define (fib n)
    (cond ((= n 0) 0)
          ((= n 1) 1)
          (else (+ (fib (- n 1))
                   (fib (- n 2))))))
#+end_src

Let's test ~fact~:

#+begin_src scheme
  (define start (runtime))

  (eval '(define (fact n)
           (if (= n 1)
               1
               (* n (fact (- n 1)))))
        the-global-environment)

  (eval '(fact 140)
        the-global-environment)

  (display (- (runtime) start))
#+end_src

With memoization:
#+begin_src scheme
  ;; ok
  ;; 13462012475717524605876073858941615558355851148193967190051391468057460367090535696797920946629681836680869097041958983702264048370902871114013579941370766400374327741701139895604871545254810788060989321379840000000000000000000000000000000000
  ;; 1556
#+end_src

Without memoization:

#+begin_src scheme
  ;; ok
  ;; 13462012475717524605876073858941615558355851148193967190051391468057460367090535696797920946629681836680869097041958983702264048370902871114013579941370766400374327741701139895604871545254810788060989321379840000000000000000000000000000000000
  ;; 53581
#+end_src

When calling ~(fact <EXP>)~, ~<EXP>~ is turned into a thunk. So the
body of ~fact~ will be evaluated in an environment where ~n~ (the
parameter name to which ~<EXP>~ corresponds to) is bound to that
thunk. Given the body of ~fact~ we need the value of ~n~ twice (when
~n~ is not 1). Getting the value of ~n~ requires looking up the value
of the variable in the environment. If we memoize, then we need to do
that once (the second time we already have the value in the thunk we
has become an ~evaluated-thunk~). If we don't memoize, then we need to
do it twice. /Mutatis mutandis/ for ~fib~.
