blog/36.html
<div id="outline-container-org86e6f2c" class="outline-3">
<h3 id="org86e6f2c">Exercise 4.28</h3>
<div class="outline-text-3" id="text-org86e6f2c">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
<code>Eval</code> uses <code>actual-value</code> rather than <code>eval</code> to evaluate the operator
before passing it to <code>apply</code>, in order to force the value of the
operator. Give an example that demonstrates the need for this forcing.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Example: higher order functions. E.g., <code>map</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">Unmodified evaluator (using `actual-value'):</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">add1</span> x)
  (+ x 1))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">map</span> proc items)
  (<span style="color: #531ab6;">if</span> (null? items)
      '()
      (cons (proc (car items))
            (<span style="color: #531ab6;">map</span> proc (cdr items)))))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">map</span> add1 '(1 2 3))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
(2 3 4)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">Using `eval' instead of `actual-value':</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">add1</span> x)
  (+ x 1))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(add1 5)

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
6

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">map</span> proc items)
  (<span style="color: #531ab6;">if</span> (null? items)
      '()
      (cons (proc (car items))
            (<span style="color: #531ab6;">map</span> proc (cdr items)))))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">map</span> add1 '(1 2 3))
. . Unknown procedure type -- APPLY (thunk add1 #0=(((<span style="color: #531ab6;">map</span> add1 try false true car cdr cons null? = + - * /) (procedure (proc items) ((<span style="color: #531ab6;">if</span> (null? items) '() (cons (proc (car items)) (<span style="color: #531ab6;">map</span> proc (cdr items))))) #0#) (procedure (x) ((+ x 1)) #0#) (procedure (a b) ((<span style="color: #531ab6;">if</span> (= a 0) 1 b)) #0#) #...
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c6cf29" class="outline-3">
<h3 id="org0c6cf29">Exercise 4.29</h3>
<div class="outline-text-3" id="text-org0c6cf29">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Exhibit a program that you would expect to run much more slowly
without memoization than with memoization.  Also, consider the
following interaction, where the <code>id</code> procedure is defined as in *Note 4.27
and <code>count</code> starts at 0:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">square</span> x)
  (* x x))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(square (id 10))
<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
<span style="color: #005f5f;">&lt;RESPONSE&gt;</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
count
<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
<span style="color: #005f5f;">&lt;RESPONSE&gt;</span>
</pre>
</div>

<p>
Give the responses both when the evaluator memoizes and when it
does not.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
The argument of <code>(square (id 10))</code> is delayed (turned into a thunk),
In the body of <code>square</code>, though, we have the application of a
primitive procedure (<code>(* thunk thunk)</code>) so the thunks must be
forced. Given that the two thunks are the same thunk, if we memoize,
then the final &lt;RESPONSE&gt; is 1, otherwise is 2. The first &lt;RESPONSE&gt;
is 100, regardless of whether we memoize or not.
</p>

<p>
Clearly memoization will entail an improvement in performance in those
cases in which we need the value for the same thunk many times and
where forcing the thunk requires non-trivial computation.
</p>

<p>
The procedures <code>fact</code> and <code>fib</code> are two example where a difference can
be seen.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(eval '(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">fact</span> n)
         (<span style="color: #531ab6;">if</span> (= n 1)
             1
             (* n (fact (- n 1)))))
      the-global-environment)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">fib</span> n)
  (<span style="color: #531ab6;">cond</span> ((= n 0) 0)
        ((= n 1) 1)
        (<span style="color: #531ab6;">else</span> (+ (fib (- n 1))
                 (fib (- n 2))))))
</pre>
</div>

<p>
Let's test <code>fact</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">start</span> (runtime))

(eval '(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">fact</span> n)
         (<span style="color: #531ab6;">if</span> (= n 1)
             1
             (* n (fact (- n 1)))))
      the-global-environment)

(eval '(fact 140)
      the-global-environment)

(display (- (runtime) start))
</pre>
</div>

<p>
With memoization:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">ok</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">13462012475717524605876073858941615558355851148193967190051391468057460367090535696797920946629681836680869097041958983702264048370902871114013579941370766400374327741701139895604871545254810788060989321379840000000000000000000000000000000000</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">1556</span>
</pre>
</div>

<p>
Without memoization:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">ok</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">13462012475717524605876073858941615558355851148193967190051391468057460367090535696797920946629681836680869097041958983702264048370902871114013579941370766400374327741701139895604871545254810788060989321379840000000000000000000000000000000000</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">53581</span>
</pre>
</div>

<p>
When calling <code>(fact &lt;EXP&gt;)</code>, <code>&lt;EXP&gt;</code> is turned into a thunk. So the
body of <code>fact</code> will be evaluated in an environment where <code>n</code> (the
parameter name to which <code>&lt;EXP&gt;</code> corresponds to) is bound to that
thunk. Given the body of <code>fact</code> we need the value of <code>n</code> twice (when
<code>n</code> is not 1). Getting the value of <code>n</code> requires looking up the value
of the variable in the environment. If we memoize, then we need to do
that once (the second time we already have the value in the thunk we
has become an <code>evaluated-thunk</code>). If we don't memoize, then we need to
do it twice. <i>Mutatis mutandis</i> for <code>fib</code>.
</p>
</div>
</div>
