blog/36.html
<div id="outline-container-org51eab94" class="outline-3">
<h3 id="org51eab94">Exercise 4.30</h3>
<div class="outline-text-3" id="text-org51eab94">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Cy D. Fect, a reformed C programmer, is worried that some side effects
may never take place, because the lazy evaluator doesn't force the
expressions in a sequence.  Since the value of an expression in a
sequence other than the last one is not used (the expression is there
only for its effect, such as assigning to a variable or printing),
there can be no subsequent use of this value (e.g., as an argument to
a primitive procedure) that will cause it to be forced.  Cy thus
thinks that when evaluating sequences, we must force all expressions
in the sequence except the final one.  He proposes to modify
<code>eval-sequence</code> from section 4-1-1 to use <code>actual-value</code> rather than
<code>eval</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-sequence</span> exps env)
  (<span style="color: #531ab6;">cond</span> ((last-exp? exps) (eval (first-exp exps) env))
        (<span style="color: #531ab6;">else</span> (actual-value (first-exp exps) env)
              (eval-sequence (rest-exps exps) env))))
</pre>
</div>

<p>
a. Ben Bitdiddle thinks Cy is wrong.  He shows Cy the <code>for-each</code>
procedure described in Exercise 2-23, which gives an important example
of a sequence with side effects:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">for-each</span> proc items)
  (<span style="color: #531ab6;">if</span> (null? items)
      'done
      (<span style="color: #531ab6;">begin</span> (proc (car items))
             (<span style="color: #531ab6;">for-each</span> proc (cdr items)))))
</pre>
</div>

<p>
He claims that the evaluator in the text (with the original
<code>eval-sequence</code>) handles this correctly:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">for-each</span> (<span style="color: #531ab6;">lambda</span> (x) (newline) (display x))
          (list 57 321 88))
57
321
88
<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
done
</pre>
</div>

<p>
Explain why Ben is right about the behavior of <code>for-each</code>.
</p>

<p>
b. Cy agrees that Ben is right about the <code>for-each</code> example, but says
that that's not the kind of program he was thinking about when he
proposed his change to <code>eval-sequence</code>.  He defines the following two
procedures in the lazy evaluator:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">p1</span> x)
  (set! x (cons x '(2)))
  x)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">p2</span> x)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">p</span> e)
    e
    x)
  (p (set! x (cons x '(2)))))
</pre>
</div>

<p>
What are the values of <code>(p1 1)</code> and <code>(p2 1)</code> with the original
<code>eval-sequence</code>?  What would the values be with Cy's proposed change
to <code>eval-sequence</code>?
</p>

<p>
c. Cy also points out that changing <code>eval-sequence</code> as he proposes
   does not affect the behavior of the example in part a.  Explain why
   this is true.
</p>

<p>
d. How do you think sequences ought to be treated in the lazy
   evaluator?  Do you like Cy's approach, the approach in the text, or
   some other approach?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
a.
</p>

<p>
There is nothing to force in the example. For the expressions in the
sequences are not thunks.
</p>

<p>
When we evaluate something like
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">begin</span>
  (display <span style="color: #3548cf;">"foo"</span>)
  ...)
</pre>
</div>
<p>
we are going to, among other things, apply <code>eval</code> to <code>(display
"foo")</code>. And that is enough to carry out the complete application of
<code>display</code> to <code>"foo"</code>.
</p>

<p>
b.
</p>

<p>
When using the original <code>eval-sequence</code>, the value of <code>(p1 1)</code> is <code>(1
2)</code>: the evaluation of <code>p1</code>'s definition creates a procedure object
whose environment is the global environment.  The application of <code>p1</code>
to <code>1</code>, first, creates a new environment by extending the global
environment with a frame which binds <code>x</code> to a thunk whose expression
is 1 and whose environment is the global evironment; and, second,
evaluates the body of <code>p1</code> within that environment. This latter
evaluation entails the application of <code>eval</code> to <code>(set! x (cons x
'(2)))</code> and <code>x</code>.  The evaluation of <code>(set!  x (cons x '(2)))</code> entails
the forcing of <code>x</code>, because primitive procedures must receive values
they can understand &#x2014; not thunks. So the value of <code>x</code> is set to <code>(1
2)</code>.
</p>

<p>
When using Cy's <code>eval-sequence</code>, the value of <code>(p1 1)</code> should be <code>(1
2)</code> as well.
</p>

<p>
When using the original <code>eval-sequence</code>, the value of <code>(p2 1)</code> is a
thunk. The evaluation of <code>p2</code>'s definition creates a procedure object
whose environment is the global environment. The application of <code>p2</code>
to <code>1</code>, first, creates a new environment by extending the global
environment with a frame which binds <code>x</code> to a thunk whose expression
is 1 and whose environment is the global evironment; and, second,
evaluates the body of of <code>p2</code> within that environment. This latter
evaluation entails the evaluation of the definition of <code>p</code> and the
application of <code>p</code> to <code>(set! x (cons x '(2)))</code>. The evaluation of the
definition of <code>p</code> creates a procedures object whose environment is the
environment <code>p2</code> points to. The application of <code>p</code> to <code>(set! x (cons x
'(2)))</code>, first, creates a new environment by extending the environment
<code>p</code> points to with a frame which binds <code>e</code> to a thunk whose expression
is <code>(set! x (cons x '(2)))</code> and whose environemnt is the environment
<code>p</code> points to. This latter evaluation entails the evaluation of <code>e</code>
and <code>x</code> (in the environemnt <code>p</code> points to). <code>e</code> evaluates to the thunk
described above and nothing is done with it. <code>x</code> evaluates to the
other thunk described above and it is returned (it is the value of the
<code>p</code>'s application). So the final value is that thunk.
</p>

<p>
When using Cy's <code>eval-sequence</code>, the value of <code>(p2 1)</code> should be <code>(1
2)</code> &#x2014; that's because we are not applying <code>eval</code> to <code>e</code>; we are
instead applying <code>actual-value</code> to it.
</p>

<p>
c.
</p>

<p>
The difference between the old <code>eval-sequence</code> and the new one with
respect to the example in a. is that, when using the old procedure, we
apply <code>eval</code> to <code>(proc (car items))</code>, whereas, when using the new one,
we apply <code>actual-value~</code> to it.
</p>

<p>
When we apply <code>eval</code> to <code>(proc (car items))</code>, <code>items</code> have already
been forced, because <code>null?</code> has been applied to them. <code>proc</code> is
forced, because it is the operator of an application. So the value of
the application of <code>eval</code> is the expression's actual value.
</p>

<p>
When we apply <code>actual-value</code> to <code>(proc (car items))</code>, there is an
extra step: we passed the evaluated value to <code>force-it</code>. But since the
value is not a thunk, nothing changes.
</p>

<p>
d.
</p>

<p>
Cy's seems a better approach, since i) it ensures that side effects
take place in both a-type cases and b-type cases, and ii) the
difference with the other approach is minimal when it comes to a-type
cases.
</p>
</div>
</div>
