blog/36.html
<div id="outline-container-orgf2145dc" class="outline-3">
<h3 id="orgf2145dc">Exercise 4.31</h3>
<div class="outline-text-3" id="text-orgf2145dc">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
The approach taken in this section is somewhat unpleasant, because it
makes an incompatible change to Scheme.  It might be nicer to
implement lazy evaluation as an <i>upward-compatible extension</i>, that
is, so that ordinary Scheme programs will work as before.  We can do
this by extending the syntax of procedure declarations to let the user
control whether or not arguments are to be delayed.  While we're at
it, we may as well also give the user the choice between delaying with
and without memoization.  For example, the definition
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">f</span> a (b lazy) c (d lazy-memo))
  ...)
</pre>
</div>

<p>
would define <code>f</code> to be a procedure of four arguments, where the first
and third arguments are evaluated when the procedure is called, the
second argument is delayed, and the fourth argument is both delayed
and memoized.  Thus, ordinary procedure definitions will produce the
same behavior as ordinary Scheme, while adding the `lazy-memo'
declaration to each parameter of every compound procedure will produce
the behavior of the lazy evaluator defined in this section. Design and
implement the changes required to produce such an extension to Scheme.
You will have to implement new syntax procedures to handle the new
syntax for `define'.  You must also arrange for `eval' or `apply' to
determine when arguments are to be delayed, and to force or delay
arguments accordingly, and you must arrange for forcing to memoize or
not, as appropriate.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<ul class="org-ul">
<li>Changes:
<ul class="org-ul">
<li><code>apply-evaluator</code>, instead of using <code>list-of-delayed-args</code>, uses
<code>list-of-args</code> which can decide whether to delay an argument or
not, since it receives that information which, thanks to the new
syntax, is possibly included in the parameters (I'm packing that
information into the arguments that <code>list-of-args</code> receives).</li>

<li>When we delay an argument, we create a thunk which now contains
information about whether the forcing should use memoization or
not. More concretely, the second element of a thunk is now either
the symbol <code>memo</code> or the symbol <code>no-memo</code>.</li>
</ul></li>

<li><p>
Here are new methods and modified methods:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">to-delay?</span> arg-with-info)
  (<span style="color: #531ab6;">cond</span> ((not (pair? arg-with-info))
         (error <span style="color: #3548cf;">"arg-with-info is expected to be a pair"</span>))
        (<span style="color: #531ab6;">else</span> (<span style="color: #531ab6;">or</span> (eq? (car arg-with-info) 'lazy)
                  (eq? (car arg-with-info) 'lazy-memo)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">arg</span> arg-with-info)
  (cdr arg-with-info))

<span style="color: #595959;">;; </span><span style="color: #595959;">apply either `actual-value` or `delay-it` depending on the symbol</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">attached</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">list-of-args</span> exps env)
  (<span style="color: #531ab6;">if</span> (no-operands? exps)
      '()
      (cons (actual-value-or-delay (first-operand exps) env)
            (list-of-args (rest-operands exps) env))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">actual-value-or-delay</span> operand-with-info env)
  (<span style="color: #531ab6;">if</span> (to-delay? operand-with-info)
      (delay-it operand-with-info env)
      (actual-value (arg operand-with-info) env)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-args-with-info</span> args params-with-info)
  (<span style="color: #531ab6;">if</span> (null? args)
      '()
      (<span style="color: #531ab6;">if</span> (pair? (car params-with-info))

          (cons (cons (memo-info-symbol (car params-with-info))
                      (car args))
                (make-args-with-info (cdr args)
                                     (cdr params-with-info)))
          (cons (cons 'non-lazy (car args))
                (make-args-with-info (cdr args)
                                     (cdr params-with-info))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">memo-info-symbol</span> param-with-info)
  (cadr param-with-info))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">force-it</span> obj)
  (<span style="color: #531ab6;">cond</span> ((thunk? obj)
         (<span style="color: #531ab6;">if</span> (eq? (cadr obj) 'lazy) <span style="color: #595959;">;; </span><span style="color: #595959;">no memo</span>
             (actual-value (thunk-exp obj) (thunk-env obj))
             (<span style="color: #531ab6;">let</span> ((result (actual-value <span style="color: #595959;">;; </span><span style="color: #595959;">memo</span>
                            (thunk-exp obj)
                            (thunk-env obj))))
               (set-car! obj 'evaluated-thunk)
               (set-car! (cdr obj) result)
               (set-cdr! (cdr obj) '())
               result)))
        ((evaluated-thunk? obj)
         (thunk-value obj))
        (<span style="color: #531ab6;">else</span> obj)))

<span style="color: #595959;">;; </span><span style="color: #595959;">it expects the exp to be tagged with either 'lazy or 'lazy-memo</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">delay-it</span> exp env)
  (<span style="color: #531ab6;">if</span> (to-memo? exp)
      (list 'thunk 'memo (cdr exp) env)
      (list 'thunk 'no-memo (cdr exp) env)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">to-memo?</span> exp)
  (eq? (car exp) 'lazy-memo))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">thunk-exp</span> thunk) (caddr thunk))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">thunk-env</span> thunk) (cadddr thunk))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-evaluator</span> procedure arguments env)
  (<span style="color: #531ab6;">cond</span> ((primitive-procedure? procedure)
         (apply-primitive-procedure
          procedure
          (list-of-arg-values arguments env)))
        ((compound-procedure? procedure)
         (eval-sequence
          (procedure-body procedure)
          (extend-environment
           (procedure-parameters-names procedure)
           (list-of-args (make-args-with-info arguments
                                              (procedure-parameters procedure))
                         env)
           (procedure-environment procedure))))
        (<span style="color: #531ab6;">else</span>
         (error
          <span style="color: #3548cf;">"Unknown procedure type -- APPLY"</span> procedure))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">procedure-parameters-names</span> proc)
  (param-names (cadr proc)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">param-names</span> params-with-info)
  (<span style="color: #531ab6;">cond</span> ((null? params-with-info)
         '())
        ((pair? (car params-with-info))
         (cons (car (car params-with-info))
               (param-names (cdr params-with-info))))
        (<span style="color: #531ab6;">else</span> (cons (car params-with-info)
                    (param-names (cdr params-with-info))))))
</pre>
</div></li>
</ul>


<p>
Now, for example, we could define <code>try</code> (See 4.2.1) like this:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">try</span> a (b lazy-memo))
  (<span style="color: #531ab6;">if</span> (= a 0) 1 b))
</pre>
</div>

<p>
and evaluating <code>(try 0 (/ 1 0))</code> should return 1 instead of yielding
an error.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div style="text-align: center;"><a href="./posts.html">←</a></div><p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.60 (<a href="https://orgmode.org">Org</a> mode 9.7.5)</span></p>
</div>
</body>
</html>
